teamjft/NUVOTON-NUC200/NUC200Series_sample/SampleCode/USB/HID/HIDSys.c
/****************************************************************************
 * @file     HIDSys.c
 * @version  V1.00
 * $Revision: 3 $
 * $Date: 12/08/06 5:57p $ 
 * @brief    NUC200 Series USB HID System API
 *
 * @note
 * Copyright (C) 2011 Nuvoton Technology Corp. All rights reserved.
 *
 ******************************************************************************/
#include <stdio.h>
#include "NUC200Series.h"
#include "HIDSys.h"
#include "HID_API.h"


//#define DBG_PRINTF     printf
#define DBG_PRINTF(...)

#define Maximum(a,b)		((a)>(b) ? (a) : (b))


S_HID_DEVICE g_HID_sDevice;

/* Endpoint description */
S_USBD_EP_CTRL sEpDescription[] = 
{
	{CTRL_EP_NUM   | EP_INPUT , HID_MAX_PACKET_SIZE_CTRL   , NULL},   /* EP Id 0, EP Addr 0, input , max packe size = 64 */ 
	{CTRL_EP_NUM   | EP_OUTPUT, HID_MAX_PACKET_SIZE_CTRL   , NULL},   /* EP Id 1, EP Addr 0, output, max packe size = 64 */ 
	{INT_IN_EP_NUM | EP_INPUT , HID_MAX_PACKET_SIZE_INT_IN , NULL},   /* EP Id 2, EP Addr 1, input , max packe size =  8 */ 
	{0x00,  0, NULL}
};

/* bus event call back */
S_USBD_EVENT_PROCESS g_sBusOps[6] = 
{
	{NULL, NULL},                               /* attach event callback */
	{NULL, NULL},                               /* detach event callback */
	{USBD_BusResetCallback, &g_HID_sDevice},  /* bus reset event callback */
	{USBD_BusSuspendCallback, &g_HID_sDevice},/* bus suspend event callback */
	{USBD_BusResumeCallback, &g_HID_sDevice},                               /* bus resume event callback */
	{USBD_CtrlSetupAck, &g_HID_sDevice},      /* setup event callback */
};

/* USB event call back */
S_USBD_EVENT_PROCESS g_sUsbOps[12] = 
{
	{USBD_CtrlDataInAck   , &g_HID_sDevice},/* ctrl pipe0 (EP address 0) In ACK callback */
	{USBD_CtrlDataOutAck  , &g_HID_sDevice},/* ctrl pipe0 (EP address 0) Out ACK callback */
	{HID_IntInCallback      , &g_HID_sDevice},/* EP address 1 In ACK callback */
	{NULL, NULL},                             /* EP address 1 Out ACK callback */
	{NULL, NULL},                             /* EP address 2 In ACK callback */  
	{NULL, NULL},                             /* EP address 2 Out ACK callback */  
	{NULL, NULL},                             /* EP address 3 In ACK callback */  
	{NULL, NULL},                             /* EP address 3 Out ACK callback */  
	{NULL, NULL},                             /* EP address 4 In ACK callback */  
	{NULL, NULL},                             /* EP address 4 Out ACK callback */  
	{NULL, NULL},                             /* EP address 5 In ACK callback */  
	{NULL, NULL},                             /* EP address 5 Out ACK callback */  
};

/*ctrl pipe call back.                                                                  */
/*it will be call by USBD_CtrlSetupAck, USBD_CtrlDataInAck and USBD_CtrlDataOutAck*/
/*if in ack handler and out ack handler is 0, default handler will be called            */
S_USBD_CTRL_CALLBACK_ENTRY g_asCtrlCallbackEntry[] =
{   //request type,command     ,setup ack handler         , in ack handler      ,out ack handler,  parameter
	{REQ_STANDARD, SET_ADDRESS, USBD_CtrlSetupSetAddress, USBD_CtrlDataInSetAddress, 0, &g_HID_sDevice},
	{REQ_STANDARD, CLEAR_FEATURE, USBD_CtrlSetupClearSetFeature, 0, 0, &g_HID_sDevice},
	{REQ_STANDARD, SET_FEATURE, USBD_CtrlSetupClearSetFeature, 0, 0, &g_HID_sDevice},
	{REQ_STANDARD, GET_CONFIGURATION, USBD_CtrlSetupGetConfiguration, 0, 0, &g_HID_sDevice},
	{REQ_STANDARD, GET_STATUS, USBD_CtrlSetupGetStatus, 0, 0, &g_HID_sDevice},
	{REQ_STANDARD, GET_INTERFACE, USBD_CtrlSetupGetInterface, 0, 0, &g_HID_sDevice},
	{REQ_STANDARD, SET_INTERFACE, USBD_CtrlSetupSetInterface, 0, 0, &g_HID_sDevice},
	{REQ_STANDARD, GET_DESCRIPTOR, HID_CtrlSetupGetDescriptor, HID_CtrlGetDescriptorIn, HID_CtrlGetDescriptorOut, &g_HID_sDevice},
	{REQ_STANDARD, SET_CONFIGURATION, USBD_CtrlSetupSetConfiguration, 0, 0, &g_HID_sDevice},
	/* To support boot protocol */
	{REQ_CLASS, SET_REPORT, HID_CtrlSetupSetReport, 0, 0, &g_HID_sDevice},
	{REQ_CLASS, SET_IDLE, HID_CtrlSetupSetIdle, 0, 0, &g_HID_sDevice},
	{REQ_CLASS, SET_PROTOCOL, HID_CtrlSetupSetProtocol, 0, 0, &g_HID_sDevice},
	{REQ_CLASS, GET_PROTOCOL, HID_CtrlSetupGetProtocol, 0, 0, &g_HID_sDevice},
};


static void HID_UsbStartCallBack(void * pVoid);
static int32_t HID_IsConfigureValue(uint8_t u8ConfigureValue);
static void HID_Reset(S_HID_DEVICE *psDevice);
static void HID_Start(S_HID_DEVICE *psDevice);

//register to USB driver
S_USBD_CLASS sHidUsbClass = 
{
	(void *)&g_HID_sDevice, 
	HID_UsbStartCallBack,
	HID_IsConfigureValue
};


static const uint8_t * gpu8UsbBuf = 0;
static uint32_t gu32BytesInUsbBuf = 0;
static int8_t gIsOverRequest = 0;


//uint32_t HID_GetVersion(VOID)
//{
//	return HID_VERSION_NUM;
//}

/*************************************************************************/
/*                                                                       */
/* DESCRIPTION                                                           */
/*      To initial the descriptors and install the handlers.             */
/*                                                                       */
/* INPUTS                                                                */
/*      pVoid     not used now                                           */
/*                                                                       */
/* OUTPUTS                                                               */
/*      None                                                             */
/*                                                                       */
/* RETURN                                                                */
/*      0           Success                                              */
/*		Otherwise	error												 */
/*                                                                       */
/*************************************************************************/
int32_t HID_Open(void)
{
	int32_t i32Ret = 0;
	
	g_HID_sDevice.isReportProtocol = 1;

	g_HID_sDevice.device = (void *)USBD_InstallClassDevice(&sHidUsbClass);
	
	g_HID_sDevice.au8DeviceDescriptor = g_HID_au8DeviceDescriptor;
	g_HID_sDevice.au8ConfigDescriptor = g_HID_au8ConfigDescriptor;
	
	g_HID_sDevice.pu8HIDDescriptor = g_HID_sDevice.au8ConfigDescriptor + LEN_CONFIG + LEN_INTERFACE;	
	g_HID_sDevice.pu8IntInEPDescriptor = g_HID_sDevice.au8ConfigDescriptor + LEN_CONFIG + LEN_INTERFACE + LEN_HID;
	
	g_HID_sDevice.sVendorInfo.psVendorStringDesc = &g_HID_sVendorStringDesc;
	g_HID_sDevice.sVendorInfo.psProductStringDesc = &g_HID_sProductStringDesc;
	g_HID_sDevice.sVendorInfo.u16VendorId = *(uint16_t *)&g_HID_sDevice.au8DeviceDescriptor[8];
	g_HID_sDevice.sVendorInfo.u16ProductId = *(uint16_t *)&g_HID_sDevice.au8DeviceDescriptor[10];

	i32Ret = USBD_InstallCtrlHandler(g_HID_sDevice.device, g_asCtrlCallbackEntry, 
					sizeof(g_asCtrlCallbackEntry) / sizeof(g_asCtrlCallbackEntry[0]));



	return i32Ret;
}

void HID_Close(void)
{

