teamjft/NUVOTON-NUC200/NUC200Series_sample/SampleCode/USB/HID/HIDSys.c
}

static void HID_UsbStartCallBack(void * pVoid)
{
	HID_Reset((S_HID_DEVICE *)pVoid);
	HID_Start((S_HID_DEVICE *)pVoid);
}

static void HID_Reset(S_HID_DEVICE *psDevice)
{	
	USBD_Reset(1);
}

static void HID_Start(S_HID_DEVICE *psDevice)
{
    __weak extern void HID_SetFirstOutReport(void);
    __weak extern void HID_SetFirstInReport(void);

    /* To prepare the first IN report if it is necessary */
    if((uint32_t)HID_SetFirstInReport)
        HID_SetFirstInReport();


    /* To prepare the first OUT report if it is necessary */
    if((uint32_t)HID_SetFirstOutReport)
        HID_SetFirstOutReport();
}


/*************************************************************************/
/*                                                                       */
/* DESCRIPTION                                                           */
/*      interrupt pipe call back function                                */
/*                                                                       */
/* INPUTS                                                                */
/*      pVoid     parameter passed by g_sUsbOps[]                        */
/*                                                                       */
/* OUTPUTS                                                               */
/*      None                                                             */
/*                                                                       */
/* RETURN                                                                */
/*      None                                                             */
/*                                                                       */
/*************************************************************************/
void HID_IntInCallback(void * pVoid)
{
    S_HID_DEVICE* psDevice = (S_HID_DEVICE*) pVoid;
	
	psDevice->isReportReady = 0;
}

int32_t HID_GetVendorInfo(S_VENDOR_INFO *psVendorInfo)
{
	if (! psVendorInfo)
	{
		//return (E_HID_NULL_POINTER);
		return -1;
	}

	psVendorInfo->u16VendorId = g_HID_sDevice.sVendorInfo.u16VendorId;
	psVendorInfo->u16ProductId = g_HID_sDevice.sVendorInfo.u16ProductId;
	psVendorInfo->psVendorStringDesc = g_HID_sDevice.sVendorInfo.psVendorStringDesc;
	psVendorInfo->psProductStringDesc = g_HID_sDevice.sVendorInfo.psProductStringDesc;
	
	return 0;
}

/*************************************************************************/
/*                                                                       */
/* DESCRIPTION                                                           */
/*      Set vendor and product ID, and the string descriptor respectively*/
/*                                                                       */
/* INPUTS                                                                */
/*      psVendorInfo     vendor info structure                           */
/*                                                                       */
/* OUTPUTS                                                               */
/*      None                                                             */
/*                                                                       */
/* RETURN                                                                */
/*      0           Success                                              */
/*		Otherwise	error												 */
/*                                                                       */
/*************************************************************************/
int32_t HID_SetVendorInfo(const S_VENDOR_INFO *psVendorInfo)
{
	if (! psVendorInfo ||
	        ! psVendorInfo->psVendorStringDesc ||
	        ! psVendorInfo->psProductStringDesc)
	{
		//return (E_HID_NULL_POINTER);
		return -1;
	}

	g_HID_sDevice.sVendorInfo.u16VendorId = psVendorInfo->u16VendorId;
	g_HID_sDevice.sVendorInfo.u16ProductId = psVendorInfo->u16ProductId;
	g_HID_sDevice.sVendorInfo.psVendorStringDesc = psVendorInfo->psVendorStringDesc;
	g_HID_sDevice.sVendorInfo.psProductStringDesc = psVendorInfo->psProductStringDesc;

	return 0;
}


/*************************************************************************/
/*                                                                       */
/* DESCRIPTION                                                           */
/*      Set report descriptor. if not set, default will be used          */
/*      default HID report descriptor is mouse.                          */
/*                                                                       */
/* INPUTS                                                                */
/*      pu8ReportDescriptor     report descriptor buffer                 */
/*      u32ReportDescriptorSize report descriptor size                   */
/*                                                                       */
/* OUTPUTS                                                               */
/*      None                                                             */
/*                                                                       */
/* RETURN                                                                */
/*      0           Success                                              */
/*		Otherwise	error												 */
/*                                                                       */
/*************************************************************************/
int32_t HID_SetReportDescriptor(const uint8_t* pu8ReportDescriptor, uint32_t u32ReportDescriptorSize)
{
	if (pu8ReportDescriptor == NULL)
	{
		return -1;
	}

	g_HID_sDevice.pu8ReportDescriptor = pu8ReportDescriptor;
	g_HID_sDevice.u32ReportDescriptorSize = u32ReportDescriptorSize;
	
	return 0;
}

/*************************************************************************/
/*                                                                       */
/* DESCRIPTION                                                           */
/*      Set report buffer and size for interrupt pipe                    */
/*                                                                       */
/* INPUTS                                                                */
/*      pu8Report     buffer that will be sent to host when interupt IN  */
/*						happen                                           */
/*      u32ReportSize     buffer size                                    */
/*                                                                       */
/* OUTPUTS                                                               */
/*      None                                                             */
/*                                                                       */
/* RETURN                                                                */
/*      0           Success                                              */
/*		Otherwise	error												 */
/*                                                                       */
/*************************************************************************/
int32_t HID_SetReportBuf(uint8_t* pu8Report, uint32_t u32ReportSize)
{
	if (pu8Report == NULL)
	{
		return -1;
	}
	if (u32ReportSize > HID_MAX_PACKET_SIZE_INT_IN)
	{
		return -1;
	}

	g_HID_sDevice.pu8Report = pu8Report;
	g_HID_sDevice.u32ReportSize = u32ReportSize;
    g_HID_sDevice.isReportReady = 0;

