teamjft/NUVOTON-NUC200/NUC200Series_sample/SampleCode/USB/HID/HIDSys.c
	return 0;
}


/*************************************************************************/
/*                                                                       */
/* DESCRIPTION                                                           */
/*      whether or not the configure value is configure value of HID     */
/*                                                                       */
/* INPUTS                                                                */
/*      pVoid     parameter passed by USBD_RegisterCtrl                */
/*                                                                       */
/* OUTPUTS                                                               */
/*      None                                                             */
/*                                                                       */
/* RETURN                                                                */
/*      0           Success                                              */
/*		Otherwise	error												 */
/*                                                                       */
/*************************************************************************/
static int32_t HID_IsConfigureValue(uint8_t u8ConfigureValue)
{
	return (u8ConfigureValue == g_HID_au8ConfigDescriptor[5]);
}


/*************************************************************************/
/*                                                                       */
/* DESCRIPTION                                                           */
/*      The handler of Set Report request of HID request.                */
/*                                                                       */
/* INPUTS                                                                */
/*      pVoid     parameter passed by USBD_InstallCtrlHandler          */
/*                                                                       */
/* OUTPUTS                                                               */
/*      None                                                             */
/*                                                                       */
/* RETURN                                                                */
/*      0           Success                                              */
/*		Otherwise	error												 */
/*                                                                       */
/*************************************************************************/
void HID_CtrlSetupSetReport(void * pVoid)
{
	S_USBD_DEVICE *psDevice = (S_USBD_DEVICE *)((S_HID_DEVICE *)pVoid)->device;

    //DBG_PRINTF("HID - Set Report");
	if(psDevice->au8Setup[3] == 1)
	{
        /* Report Type = input */

		// Trigger next Control Out DATA1 Transaction.
		_USBD_SET_EP_TOG_BIT(1,0);
		_USBD_TRIG_EP(1, 0);

        //DBG_PRINTF(" - Input\n");
	}
	else if (psDevice->au8Setup[3] == 2)
	{
		_USBD_SET_EP_TOG_BIT(1, 0);
		_USBD_TRIG_EP(1, 0x00);

        //DBG_PRINTF(" - Output\n");
	}
	else if (psDevice->au8Setup[3] == 3)
	{
        /* Request Type = Feature */
		_USBD_SET_EP_TOG_BIT(1,0);
		_USBD_TRIG_EP(1,0x00);

        //DBG_PRINTF(" - Feature\n");
	}
	else
	{
		// Not support. Reply STALL.       
        //DBG_PRINTF(" - Unknown\n");
		_HID_CLR_CTRL_READY_AND_TRIG_STALL();
	}
}

/*************************************************************************/
/*                                                                       */
/* DESCRIPTION                                                           */
/*      The handler of Set Idle request of HID request.                  */
/*                                                                       */
/* INPUTS                                                                */
/*      pVoid     parameter passed by USBD_InstallCtrlHandler          */
/*                                                                       */
/* OUTPUTS                                                               */
/*      None                                                             */
/*                                                                       */
/* RETURN                                                                */
/*      0           Success                                              */
/*		Otherwise	error												 */
/*                                                                       */
/*************************************************************************/
void HID_CtrlSetupSetIdle(void * pVoid)
{
	_USBD_SET_EP_TOG_BIT(0, 0);
	_USBD_TRIG_EP(0,0x00);
    
	//DBG_PRINTF("Set idle\n");
}

/*************************************************************************/
/*                                                                       */
/* DESCRIPTION                                                           */
/*      The handler of Set Protocol request of HID request.              */
/*                                                                       */
/* INPUTS                                                                */
/*      pVoid     parameter passed by USBD_InstallCtrlHandler          */
/*                                                                       */
/* OUTPUTS                                                               */
/*      None                                                             */
/*                                                                       */
/* RETURN                                                                */
/*      None                                                             */
/*                                                                       */
/*************************************************************************/
void HID_CtrlSetupSetProtocol(void * pVoid)
{
	S_HID_DEVICE *psDevice = (S_HID_DEVICE *) pVoid;
	S_USBD_DEVICE *pUsbDevice = (S_USBD_DEVICE *)psDevice->device;
	
	psDevice->isReportProtocol = pUsbDevice->au8Setup[2];

	_USBD_SET_EP_TOG_BIT(0,0);
	_USBD_TRIG_EP(0,0x00);
}



/*************************************************************************/
/*                                                                       */
/* DESCRIPTION                                                           */
/*      The handler of Get Protocol request of HID request.              */
/*                                                                       */
/* INPUTS                                                                */
/*      pVoid     parameter passed by USBD_InstallCtrlHandler          */
/*                                                                       */
/* OUTPUTS                                                               */
/*      None                                                             */
/*                                                                       */
/* RETURN                                                                */
/*      None                                                             */
/*                                                                       */
/*************************************************************************/
void HID_CtrlSetupGetProtocol(void * pVoid)
{
	S_HID_DEVICE *psDevice = (S_HID_DEVICE *) pVoid;
	
	USBD_DataIn(0, (const uint8_t *)&psDevice->isReportProtocol, 1);
}


static uint16_t Minimum(uint16_t a, uint16_t b)
{
	if (a > b)
		return b;
	else
		return a;
}



void HID_PrepareDescriptors(const uint8_t *pu8Descriptor, uint32_t u32DescriptorSize, uint32_t u32RequestSize, uint32_t u32MaxPacketSize)
{
    
    gu32BytesInUsbBuf = u32RequestSize;
    if(u32RequestSize > u32DescriptorSize)
    {
        gu32BytesInUsbBuf = u32DescriptorSize;
        gIsOverRequest = 1;
    }
    gpu8UsbBuf = pu8Descriptor;

    DBG_PRINTF("Get descriptor 0x%08x %d size.\n", pu8Descriptor, u32DescriptorSize);

	if(gu32BytesInUsbBuf < u32MaxPacketSize)
	{
	    USBD_DataIn(0, gpu8UsbBuf, gu32BytesInUsbBuf); 
	    gpu8UsbBuf = 0;
	    gu32BytesInUsbBuf = 0;   
	}
	else
	{
		USBD_DataIn(0, gpu8UsbBuf, u32MaxPacketSize);
		gpu8UsbBuf += u32MaxPacketSize;
		gu32BytesInUsbBuf -= u32MaxPacketSize;
    }

